//============================================
//
//	debug.h
//	Author: saito shian
//
//============================================

//============================================
// 2重インクルードガード
//============================================
#ifndef _DEBUG_H_
#define _DEBUG_H_

//============================================
// インクルード
//============================================
#include "main.h"

//============================================
// デバッグ表示クラス
//============================================
class CDebugProc
{
public:
	CDebugProc();					//コンストラクタ
	~CDebugProc();					//デストラクタ

	HRESULT Init(void);				//デバッグ表示の初期化処理
	void Uninit(void);				//デバッグ表示の終了処理

	static void Print(const char *pFormat, ...);	//デバッグ表示関数
	static void Draw(void);							//デバッグ表示の描画処理

private:
	static LPD3DXFONT m_pFont;	//フォント
	static char m_aStr[0xfff];	//表示する文字列
};

#endif