//============================================
//
//	keyset.h
//	Author: saito shian
//
//============================================

//============================================
// 2重インクルードガード
//============================================
#ifndef _KEYSET_H_
#define _KEYSET_H_

//============================================
// インクルード
//============================================
#include "main.h"

//============================================
// マクロ定義
//============================================
#define MAX_MODEL		(21)			//モデル数

//============================================
// 前方宣言
//============================================
class CKey;

//============================================
// キー設定クラス
//============================================
class CKeySet
{
public:
	CKeySet();					//コンストラクタ
	~CKeySet();					//デストラクタ

	HRESULT Init(void);			//キー設定の初期化処理
	void Uninit(void);			//キー設定の終了処理

	static CKeySet *Create();	//生成

	//getter
	int GetFrame() { return m_Frame; }				//フレーム数の取得処理
	CKey *GetKey(int key) { return m_apKey[key]; }	//キー構造体の配列の取得処理

	//setter
	void SetFrame(int frame) { m_Frame = frame; }	//ループの設定処理
	CKey *SetKey(int key) {m_apKey[key]; }			//キー構造体の配列の取得処理

private:
	int m_Frame;					//フレーム数
	CKey *m_apKey[MAX_MODEL];		//キー構造体の配列
};

#endif

